### Terraform Plan: `prod/app`
```
Acquiring state lock. This may take a few moments...
data.terraform_remote_state.base: Reading...
module.compute.data.aws_ami.ubuntu_arm64: Reading...
module.compute.data.aws_ami.ubuntu_x86: Reading...
module.compute.aws_iam_role.ec2_ssm: Refreshing state... [id=doktori-prod-ec2-ssm]
module.compute.aws_iam_role_policy.ec2_parameter_store: Refreshing state... [id=doktori-prod-ec2-ssm:doktori-prod-ec2-ssm-params]
module.compute.aws_iam_role_policy_attachment.ssm_managed: Refreshing state... [id=doktori-prod-ec2-ssm-20260221130336685900000002]
module.compute.aws_iam_instance_profile.ec2_ssm: Refreshing state... [id=doktori-prod-ec2-ssm]
module.compute.aws_iam_role_policy.ec2_ecr_pull: Refreshing state... [id=doktori-prod-ec2-ssm:doktori-prod-ec2-ecr-pull]
module.compute.aws_iam_role_policy.ec2_s3_access[0]: Refreshing state... [id=doktori-prod-ec2-ssm:doktori-prod-ec2-s3]
module.compute.aws_iam_role_policy.ec2_self_stop[0]: Refreshing state... [id=doktori-prod-ec2-ssm:doktori-prod-ec2-self-stop]
module.compute.data.aws_ami.ubuntu_arm64: Read complete after 1s [id=ami-067069a366ec13118]
module.compute.data.aws_ami.ubuntu_x86: Read complete after 1s [id=ami-04d25ae66444b2b10]
data.terraform_remote_state.base: Read complete after 3s
module.compute.aws_security_group.this["chat_observer"]: Refreshing state... [id=sg-03a7c1238f20464c5]
module.compute.aws_security_group.this["rds_monitoring"]: Refreshing state... [id=sg-084e6132254526799]
module.compute.aws_security_group.this["api"]: Refreshing state... [id=sg-0bd88a786e5f24df3]
module.compute.aws_eip.this["chat_observer"]: Refreshing state... [id=eipalloc-04097640dbc0bc426]
module.compute.aws_security_group.this["front"]: Refreshing state... [id=sg-02ad17c30943eefaa]
module.compute.aws_security_group.this["chat"]: Refreshing state... [id=sg-069d12b9756fdd387]
module.compute.aws_eip.this["nginx"]: Refreshing state... [id=eipalloc-050b53aa9215180a8]
module.compute.aws_security_group.this["ai"]: Refreshing state... [id=sg-0cdfebdb95267e1ed]
module.compute.aws_security_group.this["nginx"]: Refreshing state... [id=sg-00eec5f108aeb77dd]
module.compute.aws_instance.this["chat"]: Refreshing state... [id=i-0191fb29b83c5f845]
module.compute.aws_instance.this["front"]: Refreshing state... [id=i-0212b65a2dfba8335]
module.compute.aws_instance.this["ai"]: Refreshing state... [id=i-0bc2413c68025b682]
module.compute.aws_instance.this["chat_observer"]: Refreshing state... [id=i-07ba789113b2e75bc]
module.compute.aws_instance.this["rds_monitoring"]: Refreshing state... [id=i-0c81b7ef906b11f9c]
module.compute.aws_instance.this["api"]: Refreshing state... [id=i-01d309282ecfb432b]
module.compute.aws_security_group_rule.cross["api-from-nginx-8080"]: Refreshing state... [id=sgrule-2634594532]
module.compute.aws_instance.this["nginx"]: Refreshing state... [id=i-0a4beef9dba096fc0]
module.compute.aws_security_group_rule.cross["chat-from-nginx-8081"]: Refreshing state... [id=sgrule-1921353110]
module.compute.aws_security_group_rule.cross["front-from-nginx-3000"]: Refreshing state... [id=sgrule-3760327133]
module.compute.aws_security_group_rule.cross["ai-from-nginx-8000"]: Refreshing state... [id=sgrule-155257288]
module.compute.aws_eip_association.this["nginx"]: Refreshing state... [id=eipassoc-06d302653508a672e]
aws_route53_record.service["front"]: Refreshing state... [id=Z04783583MC5PWNZP04CM_front.prod.doktori.internal_A]
aws_route53_record.service["ai"]: Refreshing state... [id=Z04783583MC5PWNZP04CM_ai.prod.doktori.internal_A]
aws_route53_record.service["nginx"]: Refreshing state... [id=Z04783583MC5PWNZP04CM_nginx.prod.doktori.internal_A]
aws_route53_record.service["api"]: Refreshing state... [id=Z04783583MC5PWNZP04CM_api.prod.doktori.internal_A]
aws_route53_record.service["rds_monitoring"]: Refreshing state... [id=Z04783583MC5PWNZP04CM_rds-exporter.prod.doktori.internal_A]
aws_route53_record.service["chat"]: Refreshing state... [id=Z04783583MC5PWNZP04CM_chat.prod.doktori.internal_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_route53_record.service["rabbitmq"] will be created
  + resource "aws_route53_record" "service" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "rabbitmq.prod.doktori.internal"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z04783583MC5PWNZP04CM"
    }

  # aws_route53_record.service["redis"] will be created
  + resource "aws_route53_record" "service" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "redis.prod.doktori.internal"
      + records         = (known after apply)
      + ttl             = 300
      + type            = "A"
      + zone_id         = "Z04783583MC5PWNZP04CM"
    }

  # module.compute.aws_eip.this["chat_observer"] will be updated in-place
  ~ resource "aws_eip" "this" {
        id                   = "eipalloc-04097640dbc0bc426"
      ~ tags                 = {
          - "Environment" = "staging" -> null
          ~ "Name"        = "doktori-staging-nginx-eip" -> "doktori-prod-chat-observer-eip"
          ~ "Service"     = "nginx" -> "chat_observer"
        }
      ~ tags_all             = {
          ~ "Environment" = "staging" -> "prod"
          ~ "Name"        = "doktori-staging-nginx-eip" -> "doktori-prod-chat-observer-eip"
          ~ "Service"     = "nginx" -> "chat_observer"
            # (2 unchanged elements hidden)
        }
        # (13 unchanged attributes hidden)
    }

  # module.compute.aws_eip_association.this["chat_observer"] will be created
  + resource "aws_eip_association" "this" {
      + allocation_id        = "eipalloc-04097640dbc0bc426"
      + id                   = (known after apply)
      + instance_id          = "i-07ba789113b2e75bc"
      + network_interface_id = (known after apply)
      + private_ip_address   = (known after apply)
      + public_ip            = (known after apply)
    }

  # module.compute.aws_instance.this["rabbitmq"] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-067069a366ec13118"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "doktori-prod-ec2-ssm"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t4g.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "doktori-prod"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0a6a3170675ee0f55"
      + tags                                 = {
          + "Name"    = "doktori-prod-rabbitmq"
          + "Part"    = "data"
          + "Service" = "rabbitmq"
        }
      + tags_all                             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "doktori-prod-rabbitmq"
          + "Part"        = "data"
          + "Project"     = "doktori"
          + "Service"     = "rabbitmq"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp3"
        }
    }

  # module.compute.aws_instance.this["redis"] will be created
  + resource "aws_instance" "this" {
      + ami                                  = "ami-067069a366ec13118"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + enable_primary_ipv6                  = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = "doktori-prod-ec2-ssm"
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_lifecycle                   = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t4g.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "doktori-prod"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + spot_instance_request_id             = (known after apply)
      + subnet_id                            = "subnet-0a6a3170675ee0f55"
      + tags                                 = {
          + "Name"    = "doktori-prod-redis"
          + "Part"    = "data"
          + "Service" = "redis"
        }
      + tags_all                             = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "doktori-prod-redis"
          + "Part"        = "data"
          + "Project"     = "doktori"
          + "Service"     = "redis"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = 2
          + http_tokens                 = "required"
          + instance_metadata_tags      = (known after apply)
        }

      + root_block_device {
          + delete_on_termination = true
          + device_name           = (known after apply)
          + encrypted             = true
          + iops                  = (known after apply)
          + kms_key_id            = (known after apply)
          + tags_all              = (known after apply)
          + throughput            = (known after apply)
          + volume_id             = (known after apply)
          + volume_size           = 20
          + volume_type           = "gp3"
        }
    }

  # module.compute.aws_security_group.this["rabbitmq"] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "rabbitmq security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.1.0.0/16",
                ]
              + description      = "RabbitMQ AMQP from VPC"
              + from_port        = 5672
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 5672
            },
          + {
              + cidr_blocks      = [
                  + "10.1.0.0/16",
                ]
              + description      = "RabbitMQ mgmt from VPC"
              + from_port        = 15672
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 15672
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "doktori-prod-rabbitmq-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "doktori-prod-rabbitmq-sg"
          + "Service" = "rabbitmq"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "doktori-prod-rabbitmq-sg"
          + "Project"     = "doktori"
          + "Service"     = "rabbitmq"
        }
      + vpc_id                 = "vpc-0e83a399bbd0d8708"
    }

  # module.compute.aws_security_group.this["redis"] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "redis security group"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "10.1.0.0/16",
                ]
              + description      = "Redis from VPC"
              + from_port        = 6379
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 6379
            },
        ]
      + name                   = (known after apply)
      + name_prefix            = "doktori-prod-redis-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name"    = "doktori-prod-redis-sg"
          + "Service" = "redis"
        }
      + tags_all               = {
          + "Environment" = "prod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "doktori-prod-redis-sg"
          + "Project"     = "doktori"
          + "Service"     = "redis"
        }
      + vpc_id                 = "vpc-0e83a399bbd0d8708"
    }

Plan: 7 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + chat_observer_public_ip = "54.116.67.87"
  ~ compute                 = {
      ~ eip_public_ips     = null -> {
          + chat_observer = "54.116.67.87"
          + nginx         = "3.34.245.126"
        }
      ~ instance_ids       = {
          + rabbitmq       = (known after apply)
          + redis          = (known after apply)
            # (7 unchanged attributes hidden)
        }
      ~ private_ips        = {
          + rabbitmq       = (known after apply)
          + redis          = (known after apply)
            # (7 unchanged attributes hidden)
        }
      ~ security_group_ids = {
          + rabbitmq       = (known after apply)
          + redis          = (known after apply)
            # (7 unchanged attributes hidden)
        }
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```